//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <AST2500Setup.uni>
//
// Description: SIO form string definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

//If customer define the common logical device by themselves, add here.
#string STR_AST2500_SIO_FORM                        #language eng "AST2500 Super IO Configuration"
#string STR_AST2500_SIO_FORM_HELP                   #language eng "System Super IO Chip Parameters."
#string STR_AST2500_SIO_PROMPT                      #language eng "Super IO Chip"
#string STR_AST2500                                 #language eng "AST2500"

//
//Serial 1/2/3/4 Settings
//
//Below are possible resource setting for all serial port
#string STR_AST2500_SERIAL_IO3E8_IRQ7               #language eng "IO=3E8h; IRQ=7;"
#string STR_AST2500_SERIAL_IO2E8_IRQ7               #language eng "IO=2E8h; IRQ=7;"
#string STR_AST2500_SERIAL_IO2F0_IRQ7               #language eng "IO=2F0h; IRQ=7;"
#string STR_AST2500_SERIAL_IO2E0_IRQ7               #language eng "IO=2E0h; IRQ=7;"
#string STR_AST2500_SERIAL_IO3E8_IRQX               #language eng "IO=3E8h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_AST2500_SERIAL_IO2E8_IRQX               #language eng "IO=2E8h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_AST2500_SERIAL_IO2F0_IRQX               #language eng "IO=2F0h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_AST2500_SERIAL_IO2E0_IRQX               #language eng "IO=2E0h; IRQ=3,4,5,6,7,9,10,11,12;"

//
//Serial 1 settings when eSPI Interface
//
//Below are possible resource setting for com1 port
#string STR_AST2500_SERIAL1_IO3F8_IRQ4                   #language eng "IO=3F8h; IRQ=4;"
#string STR_AST2500_SERIAL1_IO2F8_IRQ4                   #language eng "IO=2F8h; IRQ=4;"
#string STR_AST2500_SERIAL1_IO3E8_IRQ4                   #language eng "IO=3E8h; IRQ=4;"
#string STR_AST2500_SERIAL1_IO2E8_IRQ4                   #language eng "IO=2E8h; IRQ=4;"
//#string STR_AST2500_SERIAL1_IO2F0_IRQ4                   #language eng "IO=2F0h; IRQ=4;"
//#string STR_AST2500_SERIAL1_IO2E0_IRQ4                   #language eng "IO=2E0h; IRQ=4;"

//
//Serial 2 settings when eSPI Interface
//
//Below are possible resource setting for com2 port
#string STR_AST2500_SERIAL2_IO3F8_IRQ3                   #language eng "IO=3F8h; IRQ=3;"
#string STR_AST2500_SERIAL2_IO2F8_IRQ3                   #language eng "IO=2F8h; IRQ=3;"
#string STR_AST2500_SERIAL2_IO3E8_IRQ3                   #language eng "IO=3E8h; IRQ=3;"
#string STR_AST2500_SERIAL2_IO2E8_IRQ3                   #language eng "IO=2E8h; IRQ=3;"
//#string STR_AST2500_SERIAL2_IO2F0_IRQ3                   #language eng "IO=2F0h; IRQ=3;"
//#string STR_AST2500_SERIAL2_IO2E0_IRQ3                   #language eng "IO=2E0h; IRQ=3;"


//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
